Documents/ПоставкаЛекарств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПоставкаЛекарств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СозданиеЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аптека</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Аптеки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провизор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПозицииЛекарств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Лекарство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоставкаЛекарств/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Накладная(Команда)
	ОбъектВорд = Новый COMОбъект("Word.Application"); 
	ОбъектВорд.Documents.Add("C:\Users\khort\Desktop\4_КУРС\1_СЕМЕСТР\Кащеева\Курсовой1С\Накладная71а.doc");  
	ШаблонВорд = ОбъектВорд.ActiveDocument;  
	

	
    Номер_наклТекст = Объект.Номер;
    ДатаТекст = Формат(Объект.Дата, "ДФ=dd.MM.yyyy");       
    ОтправительТекст = "Аптечный склад 'ФармаСклад'";
    Вид_отправителяТекст = "Распределение лекарств";
    ПолучательТекст = "Аптека " + Объект.Аптека;
    Вид_получателяТекст = "Реализация лекарственных средств";
    ОснованиеТекст = "приказ от " + ДатаТекст + " г.";
    КомуТекст = ПолучательТекст;
    Через_когоТекст = ОтправительТекст; 
    
    ШаблонВорд.Bookmarks("Номер_накл").Range.Text = Номер_наклТекст;
    ШаблонВорд.Bookmarks("Дата").Range.Text = ДатаТекст;
    ШаблонВорд.Bookmarks("Отправитель").Range.Text = ОтправительТекст;
    ШаблонВорд.Bookmarks("Вид_отправителя").Range.Text = Вид_отправителяТекст;
    ШаблонВорд.Bookmarks("Получатель").Range.Text = ПолучательТекст;
    ШаблонВорд.Bookmarks("Вид_получателя").Range.Text = Вид_получателяТекст;
    ШаблонВорд.Bookmarks("Основание").Range.Text = ОснованиеТекст;
    ШаблонВорд.Bookmarks("Кому").Range.Text = КомуТекст;
    ШаблонВорд.Bookmarks("Через_кого").Range.Text = Через_когоТекст;
    
    ТаблицаВорд = ШаблонВорд.Tables(4);
    общаяСумма = 0;

    // Собираем данные табличной части
    ДанныеТабличнойЧасти = Новый Массив;
    Для каждого строка из Объект.ПозицииЛекарств Цикл
        СтрокаДанных = Новый Структура;
        СтрокаДанных.Вставить("Лекарство", строка.Лекарство);
        СтрокаДанных.Вставить("Количество", строка.Количество);
        СтрокаДанных.Вставить("Цена", строка.Цена);
        СтрокаДанных.Вставить("Сумма", строка.Сумма);
        ДанныеТабличнойЧасти.Добавить(СтрокаДанных);
    КонецЦикла;

    // Получаем данные о лекарствах с сервера
    ДанныеЛекарств = ПолучитьДанныеЛекарств(ДанныеТабличнойЧасти);

    // Проходим по данным и заполняем таблицу
    Для Каждого ЛекарствоИзДанных Из ДанныеЛекарств Цикл
        ТаблицаВорд.Rows.Add();
        
		ТаблицаВорд.Cell(ТаблицаВорд.Rows.Count, 1).Range.Text = ЛекарствоИзДанных.Наименование;
		ТаблицаВорд.Cell(ТаблицаВорд.Rows.Count, 2).Range.Text = ЛекарствоИзДанных.Код;

        ТаблицаВорд.Cell(ТаблицаВорд.Rows.Count, 3).Range.Text = "упаковка";
        ТаблицаВорд.Cell(ТаблицаВорд.Rows.Count, 4).Range.Text = ЛекарствоИзДанных.Количество;
        ТаблицаВорд.Cell(ТаблицаВорд.Rows.Count, 5).Range.Text = ЛекарствоИзДанных.Количество;
        ТаблицаВорд.Cell(ТаблицаВорд.Rows.Count, 6).Range.Text = ЛекарствоИзДанных.Цена;
        ТаблицаВорд.Cell(ТаблицаВорд.Rows.Count, 7).Range.Text = ЛекарствоИзДанных.Сумма;
        
        общаяСумма = общаяСумма + ЛекарствоИзДанных.Сумма;
    КонецЦикла;

    Всего_отпущеноТекст = Объект.ПозицииЛекарств.Итог("Количество");
    На_суммуТекст = общаяСумма;     
    РазрешилТекст = "Шульгин С.С.";
    ОтпустилТекст = ПолучитьИнициалы(Объект.Провизор);
    Подпись_фармацевтТекст = ПолучитьФармацевта();
    
    ШаблонВорд.Bookmarks("Всего_отпущено").Range.Text = Всего_отпущеноТекст;
    ШаблонВорд.Bookmarks("На_сумму").Range.Text = На_суммуТекст;
    ШаблонВорд.Bookmarks("Разрешил").Range.Text = РазрешилТекст;
    ШаблонВорд.Bookmarks("Отпустил").Range.Text = ОтпустилТекст;
    ШаблонВорд.Bookmarks("Подпись_фармацевт").Range.Text = Подпись_фармацевтТекст;
    
    ОбъектВорд.Application.Visible = Истина;
    ОбъектВорд.Activate();
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЛекарств(ДанныеТабличнойЧасти)
    ДанныеЛекарств = Новый Массив;
    
    Для каждого СтрокаДанных Из ДанныеТабличнойЧасти Цикл
        ЛекарствоСсылка = СтрокаДанных.Лекарство;
        
        Если НЕ ЛекарствоСсылка.Пустая() Тогда
            ЛекарствоОбъект = ЛекарствоСсылка.ПолучитьОбъект();
            СтруктураЛекарства = Новый Структура;
            СтруктураЛекарства.Вставить("Код", ЛекарствоОбъект.Код);
            СтруктураЛекарства.Вставить("Наименование", ЛекарствоОбъект.Наименование);
            СтруктураЛекарства.Вставить("Количество", СтрокаДанных.Количество);
            СтруктураЛекарства.Вставить("Цена", СтрокаДанных.Цена);
            СтруктураЛекарства.Вставить("Сумма", СтрокаДанных.Сумма);
            ДанныеЛекарств.Добавить(СтруктураЛекарства);
        КонецЕсли;
    КонецЦикла;
    
    Возврат ДанныеЛекарств;
КонецФункции

&НаСервере
Функция ПолучитьФармацевта()
    Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Объект.Аптека.Код_Аптеки);
    Возврат ПолучитьИнициалы(Пользователь.ПолноеИмя);
КонецФункции

&НаСервере
Функция ПолучитьИнициалы(ПолноеИмя)
    ИмяЧасти = СтрРазделить(ПолноеИмя, " ");
    Если ИмяЧасти.Количество() >= 3 Тогда
        Фамилия = ИмяЧасти[0];
        Имя = ИмяЧасти[1];
        Отчество = ИмяЧасти[2];
        Возврат Фамилия + " " + Лев(Имя, 1) + "." + Лев(Отчество, 1) + ".";
    Иначе
        Возврат ПолноеИмя;
    КонецЕсли;
КонецФункции
